# PANDAS WORKSTATION

 Why not excel?? <br>
1. Cannot access big datasets<br>
2. No ML, Data science libraies present for analysis

In [5]:
import pandas as pd
import numpy as np

In [6]:
#Dataset formation using dictionary
dict1 ={
    "name":["Ankit", "Billi", "Mango", "Machili"],
    "city":["Darbhangha", "Kolkata", "Tree", "Sea"],
    "Marks":[100,34,12,22]
}

In [7]:
#Assigning variable to the whole dataset for easy usability in code
df = pd.DataFrame(dict1)

In [8]:
df
# here 0,1,2,3... are index/ROW
# here name, city, Marks... are column

      name        city  Marks
0    Ankit  Darbhangha    100
1    Billi     Kolkata     34
2    Mango        Tree     12
3  Machili         Sea     22

In [11]:
#Exporting dataframe to csv file with index
df.to_csv('friendsMarks_index.csv')

In [12]:
#Exporting dataframe to csv file without index
df.to_csv('friendsMarks_noIndex.csv', index=False)

In [14]:
# If data frame to big then look for first n data, where n is the number of data you want to see

#Top n Rows data
df.head(2)

    name        city  Marks
0  Ankit  Darbhangha    100
1  Billi     Kolkata     34

In [15]:
# Last n Rows data
df.tail(2)

      name  city  Marks
2    Mango  Tree     12
3  Machili   Sea     22

In [16]:
# Statistical analysis of numeric/raw data. Useful in numeric data
df.describe()

            Marks
count    4.000000
mean    42.000000
std     39.698866
min     12.000000
25%     19.500000
50%     28.000000
75%     50.500000
max    100.000000

In [20]:
# Reading a csv file
train = pd.read_csv('train.csv')

In [21]:
train

   train num        city  speed
0       1234  Darbhangha    100
1     124567     Kolkata     34
2      96099        Tree     12
3      67634         Sea     22

In [22]:
# Accessing columns or specific value using array slicing

# for accessing just the speed column of train dataset
train['speed']

0    100
1     34
2     12
3     22
Name: speed, dtype: int64

In [25]:
#Accessing and changing specific value using array slicing

#changing value of speed for train number 96099
train['speed'][2] = 120

<ipython-input-25-7a8c90f3ac21>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][2] = 120

In [26]:
train

   train num        city  speed
0       1234  Darbhangha    100
1     124567     Kolkata     34
2      96099        Tree    120
3      67634         Sea     22

In [27]:
# Changing index from 0,1,2,3... to something else
train.index=['first', 'second', 'third', 'fourth']

In [28]:
train

        train num        city  speed
first        1234  Darbhangha    100
second     124567     Kolkata     34
third       96099        Tree    120
fourth      67634         Sea     22

## 2 TYPES OF DATA STRUCTURE IN PANDAS
1. Series - one dimensional array with indexes(0,1,2,3...ora,b,c,d) for later access of elements usingng indexing, it stores a single coloumn/ row of data in a dataframe of a particular datatype such as int, float etc. It is a part of dataframe

2. DataFrame - Two-dimensional array with multiple rows and columns of diiferent kind of datatypes. A tabbular data frame ex.train_dataset used above

In [29]:
# Creating series dataset
series_dat = pd.Series(np.random.rand(10))

In [31]:
series_dat

0    0.400476
1    0.495697
2    0.119708
3    0.139293
4    0.957227
5    0.830723
6    0.847011
7    0.828244
8    0.635145
9    0.676647
dtype: float64

In [46]:
# Creating dataframe
dataframe_dat = pd.DataFrame(np.random.rand(10,5), np.arange(10))

In [47]:
dataframe_dat

          0         1         2         3         4
0  0.344921  0.053351  0.605470  0.706244  0.888164
1  0.926755  0.320483  0.115822  0.824901  0.246513
2  0.123953  0.339851  0.941673  0.659114  0.844965
3  0.161577  0.462203  0.141198  0.888019  0.491949
4  0.269655  0.929278  0.790820  0.828132  0.114584
5  0.089189  0.495081  0.827535  0.196781  0.402117
6  0.832632  0.942128  0.105272  0.646526  0.926410
7  0.476175  0.639258  0.806833  0.795651  0.979058
8  0.958656  0.588139  0.526018  0.387440  0.648430
9  0.766061  0.025220  0.625228  0.412367  0.957361

In [48]:
type(dataframe_dat) #pandas.core.frame.DataFrame
type(series_dat)    #pandas.core.series.Series

pandas.core.series.Series

In [49]:
#Finding out type of data in every column of dataset
dataframe_dat.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [50]:
#printing all the index of dataset
dataframe_dat.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [51]:
#printing all the columns of dataset
dataframe_dat.columns

RangeIndex(start=0, stop=5, step=1)

In [52]:
# Converting the whole dataset two numpy array
dataframe_dat.to_numpy()

array([[0.34492143, 0.05335144, 0.60546976, 0.70624368, 0.88816358],
       [0.92675465, 0.32048338, 0.11582216, 0.82490119, 0.24651262],
       [0.12395266, 0.33985125, 0.94167292, 0.65911449, 0.84496543],
       [0.16157676, 0.46220345, 0.14119765, 0.88801901, 0.49194875],
       [0.26965508, 0.92927776, 0.79082004, 0.82813184, 0.11458369],
       [0.08918864, 0.49508126, 0.82753543, 0.19678092, 0.40211661],
       [0.83263225, 0.94212801, 0.10527228, 0.64652596, 0.92641028],
       [0.47617548, 0.63925793, 0.80683288, 0.79565109, 0.97905806],
       [0.95865565, 0.58813892, 0.52601797, 0.38744022, 0.64842965],
       [0.76606058, 0.02521967, 0.62522795, 0.41236683, 0.95736078]])

In [53]:
#Transposing the whole dataset
dataframe_dat.T

,0,1,2,3,4,5,6,7,8,9
0,0.344921,0.926755,0.123953,0.161577,0.269655,0.089189,0.832632,0.476175,0.958656,0.766061
1,0.053351,0.320483,0.339851,0.462203,0.929278,0.495081,0.942128,0.639258,0.588139,0.025220
2,0.605470,0.115822,0.941673,0.141198,0.790820,0.827535,0.105272,0.806833,0.526018,0.625228
3,0.706244,0.824901,0.659114,0.888019,0.828132,0.196781,0.646526,0.795651,0.387440,0.412367
4,0.888164,0.246513,0.844965,0.491949,0.114584,0.402117,0.926410,0.979058,0.648430,0.957361

# 29:40